zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_sg/pic32cx_sg41/pic32cx1025sg41080-pinctrl.h
/* pb18m_gclk_io4 */
#define PB18M_GCLK_IO4 MCHP_PINMUX(b, 18, m, periph)

/* pb19_gpio */
#define PB19_GPIO MCHP_PINMUX(b, 19, gpio, gpio)

/* pb19a_eic_extint3 */
#define PB19A_EIC_EXTINT3 MCHP_PINMUX(b, 19, a, periph)

/* pb19c_sercom5_pad3 */
#define PB19C_SERCOM5_PAD3 MCHP_PINMUX(b, 19, c, periph)

/* pb19d_sercom7_pad3 */
#define PB19D_SERCOM7_PAD3 MCHP_PINMUX(b, 19, d, periph)

/* pb19f_tcc1_wo1 */
#define PB19F_TCC1_WO1 MCHP_PINMUX(b, 19, f, periph)

/* pb19g_pdec_qdi1 */
#define PB19G_PDEC_QDI1 MCHP_PINMUX(b, 19, g, periph)

/* pb19i_sdhc1_sddat1 */
#define PB19I_SDHC1_SDDAT1 MCHP_PINMUX(b, 19, i, periph)

/* pb19m_gclk_io5 */
#define PB19M_GCLK_IO5 MCHP_PINMUX(b, 19, m, periph)

/* pb20_gpio */
#define PB20_GPIO MCHP_PINMUX(b, 20, gpio, gpio)

/* pb20a_eic_extint4 */
#define PB20A_EIC_EXTINT4 MCHP_PINMUX(b, 20, a, periph)

/* pb20c_sercom3_pad0 */
#define PB20C_SERCOM3_PAD0 MCHP_PINMUX(b, 20, c, periph)

/* pb20d_sercom7_pad1 */
#define PB20D_SERCOM7_PAD1 MCHP_PINMUX(b, 20, d, periph)

/* pb20f_tcc1_wo2 */
#define PB20F_TCC1_WO2 MCHP_PINMUX(b, 20, f, periph)

/* pb20g_pdec_qdi2 */
#define PB20G_PDEC_QDI2 MCHP_PINMUX(b, 20, g, periph)

/* pb20i_sdhc1_sddat2 */
#define PB20I_SDHC1_SDDAT2 MCHP_PINMUX(b, 20, i, periph)

/* pb20m_gclk_io6 */
#define PB20M_GCLK_IO6 MCHP_PINMUX(b, 20, m, periph)

/* pb21_gpio */
#define PB21_GPIO MCHP_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 MCHP_PINMUX(b, 21, a, periph)

/* pb21c_sercom3_pad1 */
#define PB21C_SERCOM3_PAD1 MCHP_PINMUX(b, 21, c, periph)

/* pb21d_sercom7_pad0 */
#define PB21D_SERCOM7_PAD0 MCHP_PINMUX(b, 21, d, periph)

/* pb21f_tcc1_wo3 */
#define PB21F_TCC1_WO3 MCHP_PINMUX(b, 21, f, periph)

/* pb21i_sdhc1_sddat3 */
#define PB21I_SDHC1_SDDAT3 MCHP_PINMUX(b, 21, i, periph)

/* pb21m_gclk_io7 */
#define PB21M_GCLK_IO7 MCHP_PINMUX(b, 21, m, periph)

/* pb22_gpio */
#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 MCHP_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 MCHP_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 MCHP_PINMUX(b, 22, e, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 MCHP_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof_1khz */
#define PB22H_USB_SOF_1KHZ MCHP_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 MCHP_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 MCHP_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 MCHP_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 MCHP_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 MCHP_PINMUX(b, 23, e, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 MCHP_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 MCHP_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 MCHP_PINMUX(b, 23, n, periph)

/* pb30_gpio */
#define PB30_GPIO MCHP_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 MCHP_PINMUX(b, 30, a, periph)

/* pb30c_sercom7_pad0 */
#define PB30C_SERCOM7_PAD0 MCHP_PINMUX(b, 30, c, periph)

/* pb30d_sercom5_pad1 */
#define PB30D_SERCOM5_PAD1 MCHP_PINMUX(b, 30, d, periph)

/* pb30e_tc0_wo0 */
#define PB30E_TC0_WO0 MCHP_PINMUX(b, 30, e, periph)

/* pb30f_tcc4_wo0 */
#define PB30F_TCC4_WO0 MCHP_PINMUX(b, 30, f, periph)

/* pb30g_tcc0_wo6 */
#define PB30G_TCC0_WO6 MCHP_PINMUX(b, 30, g, periph)

/* pb31_gpio */
#define PB31_GPIO MCHP_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 MCHP_PINMUX(b, 31, a, periph)

/* pb31c_sercom7_pad1 */
#define PB31C_SERCOM7_PAD1 MCHP_PINMUX(b, 31, c, periph)

/* pb31d_sercom5_pad0 */
#define PB31D_SERCOM5_PAD0 MCHP_PINMUX(b, 31, d, periph)

/* pb31e_tc0_wo1 */
#define PB31E_TC0_WO1 MCHP_PINMUX(b, 31, e, periph)

/* pb31f_tcc4_wo1 */
#define PB31F_TCC4_WO1 MCHP_PINMUX(b, 31, f, periph)

/* pb31g_tcc0_wo7 */
#define PB31G_TCC0_WO7 MCHP_PINMUX(b, 31, g, periph)

/* pc6_gpio */
#define PC6_GPIO MCHP_PINMUX(c, 6, gpio, gpio)

/* pc6a_eic_extint6 */
#define PC6A_EIC_EXTINT6 MCHP_PINMUX(c, 6, a, periph)

/* pc6c_sercom6_pad2 */
#define PC6C_SERCOM6_PAD2 MCHP_PINMUX(c, 6, c, periph)

/* pc6i_sdhc0_sdcd */
#define PC6I_SDHC0_SDCD MCHP_PINMUX(c, 6, i, periph)

/* pc7_gpio */
#define PC7_GPIO MCHP_PINMUX(c, 7, gpio, gpio)

/* pc7a_eic_extint9 */
#define PC7A_EIC_EXTINT9 MCHP_PINMUX(c, 7, a, periph)

/* pc7c_sercom6_pad3 */
#define PC7C_SERCOM6_PAD3 MCHP_PINMUX(c, 7, c, periph)

/* pc7i_sdhc0_sdwp */
#define PC7I_SDHC0_SDWP MCHP_PINMUX(c, 7, i, periph)

/* pc12_gpio */
#define PC12_GPIO MCHP_PINMUX(c, 12, gpio, gpio)

/* pc12a_eic_extint12 */
#define PC12A_EIC_EXTINT12 MCHP_PINMUX(c, 12, a, periph)

/* pc12c_sercom7_pad0 */
#define PC12C_SERCOM7_PAD0 MCHP_PINMUX(c, 12, c, periph)

/* pc12d_sercom6_pad1 */
#define PC12D_SERCOM6_PAD1 MCHP_PINMUX(c, 12, d, periph)

/* pc12f_tcc0_wo2 */
#define PC12F_TCC0_WO2 MCHP_PINMUX(c, 12, f, periph)

/* pc12g_tcc1_wo6 */
#define PC12G_TCC1_WO6 MCHP_PINMUX(c, 12, g, periph)

/* pc12k_pcc_data10 */
#define PC12K_PCC_DATA10 MCHP_PINMUX(c, 12, k, periph)

/* pc12l_gmac_gmdio */
#define PC12L_GMAC_GMDIO MCHP_PINMUX(c, 12, l, periph)

/* pc13_gpio */
#define PC13_GPIO MCHP_PINMUX(c, 13, gpio, gpio)

/* pc13a_eic_extint13 */
#define PC13A_EIC_EXTINT13 MCHP_PINMUX(c, 13, a, periph)

/* pc13c_sercom7_pad1 */
#define PC13C_SERCOM7_PAD1 MCHP_PINMUX(c, 13, c, periph)

/* pc13d_sercom6_pad0 */
#define PC13D_SERCOM6_PAD0 MCHP_PINMUX(c, 13, d, periph)

/* pc13f_tcc0_wo3 */
#define PC13F_TCC0_WO3 MCHP_PINMUX(c, 13, f, periph)

/* pc13g_tcc1_wo7 */
#define PC13G_TCC1_WO7 MCHP_PINMUX(c, 13, g, periph)

/* pc13k_pcc_data11 */
#define PC13K_PCC_DATA11 MCHP_PINMUX(c, 13, k, periph)

/* pc14_gpio */
#define PC14_GPIO MCHP_PINMUX(c, 14, gpio, gpio)

/* pc14a_eic_extint14 */
#define PC14A_EIC_EXTINT14 MCHP_PINMUX(c, 14, a, periph)

/* pc14c_sercom7_pad2 */
#define PC14C_SERCOM7_PAD2 MCHP_PINMUX(c, 14, c, periph)

/* pc14d_sercom6_pad2 */
#define PC14D_SERCOM6_PAD2 MCHP_PINMUX(c, 14, d, periph)

/* pc14f_tcc0_wo4 */
#define PC14F_TCC0_WO4 MCHP_PINMUX(c, 14, f, periph)

/* pc14g_tcc1_wo0 */
#define PC14G_TCC1_WO0 MCHP_PINMUX(c, 14, g, periph)

/* pc14k_pcc_data12 */
#define PC14K_PCC_DATA12 MCHP_PINMUX(c, 14, k, periph)

/* pc14l_gmac_grx3 */
#define PC14L_GMAC_GRX3 MCHP_PINMUX(c, 14, l, periph)

