zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_sg/pic32cx_sg41/pic32cx1025sg41080-pinctrl.h
/* pc15_gpio */
#define PC15_GPIO MCHP_PINMUX(c, 15, gpio, gpio)

/* pc15a_eic_extint15 */
#define PC15A_EIC_EXTINT15 MCHP_PINMUX(c, 15, a, periph)

/* pc15c_sercom7_pad3 */
#define PC15C_SERCOM7_PAD3 MCHP_PINMUX(c, 15, c, periph)

/* pc15d_sercom6_pad3 */
#define PC15D_SERCOM6_PAD3 MCHP_PINMUX(c, 15, d, periph)

/* pc15f_tcc0_wo5 */
#define PC15F_TCC0_WO5 MCHP_PINMUX(c, 15, f, periph)

/* pc15g_tcc1_wo1 */
#define PC15G_TCC1_WO1 MCHP_PINMUX(c, 15, g, periph)

/* pc15k_pcc_data13 */
#define PC15K_PCC_DATA13 MCHP_PINMUX(c, 15, k, periph)

/* pc15l_gmac_grx2 */
#define PC15L_GMAC_GRX2 MCHP_PINMUX(c, 15, l, periph)

/* pc16_gpio */
#define PC16_GPIO MCHP_PINMUX(c, 16, gpio, gpio)

/* pc16a_eic_extint0 */
#define PC16A_EIC_EXTINT0 MCHP_PINMUX(c, 16, a, periph)

/* pc16c_sercom6_pad0 */
#define PC16C_SERCOM6_PAD0 MCHP_PINMUX(c, 16, c, periph)

/* pc16d_sercom0_pad1 */
#define PC16D_SERCOM0_PAD1 MCHP_PINMUX(c, 16, d, periph)

/* pc16f_tcc0_wo0 */
#define PC16F_TCC0_WO0 MCHP_PINMUX(c, 16, f, periph)

/* pc16g_pdec_qdi0 */
#define PC16G_PDEC_QDI0 MCHP_PINMUX(c, 16, g, periph)

/* pc16l_gmac_gtx2 */
#define PC16L_GMAC_GTX2 MCHP_PINMUX(c, 16, l, periph)

/* pc17_gpio */
#define PC17_GPIO MCHP_PINMUX(c, 17, gpio, gpio)

/* pc17a_eic_extint1 */
#define PC17A_EIC_EXTINT1 MCHP_PINMUX(c, 17, a, periph)

/* pc17c_sercom6_pad1 */
#define PC17C_SERCOM6_PAD1 MCHP_PINMUX(c, 17, c, periph)

/* pc17d_sercom0_pad0 */
#define PC17D_SERCOM0_PAD0 MCHP_PINMUX(c, 17, d, periph)

/* pc17f_tcc0_wo1 */
#define PC17F_TCC0_WO1 MCHP_PINMUX(c, 17, f, periph)

/* pc17g_pdec_qdi1 */
#define PC17G_PDEC_QDI1 MCHP_PINMUX(c, 17, g, periph)

/* pc17l_gmac_gtx3 */
#define PC17L_GMAC_GTX3 MCHP_PINMUX(c, 17, l, periph)

/* pc27_gpio */
#define PC27_GPIO MCHP_PINMUX(c, 27, gpio, gpio)

/* pc27a_eic_extint11 */
#define PC27A_EIC_EXTINT11 MCHP_PINMUX(c, 27, a, periph)

/* pc27c_sercom1_pad0 */
#define PC27C_SERCOM1_PAD0 MCHP_PINMUX(c, 27, c, periph)

/* pc27h_tpiu_traceclk */
#define PC27H_TPIU_TRACECLK MCHP_PINMUX(c, 27, h, periph)

/* pc27n_ccl_in4 */
#define PC27N_CCL_IN4 MCHP_PINMUX(c, 27, n, periph)

/* pc28_gpio */
#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint12 */
#define PC28A_EIC_EXTINT12 MCHP_PINMUX(c, 28, a, periph)

/* pc28c_sercom1_pad1 */
#define PC28C_SERCOM1_PAD1 MCHP_PINMUX(c, 28, c, periph)

/* pc28h_tpiu_traced0 */
#define PC28H_TPIU_TRACED0 MCHP_PINMUX(c, 28, h, periph)

/* pc28n_ccl_in5 */
#define PC28N_CCL_IN5 MCHP_PINMUX(c, 28, n, periph)

#endif /* MICROCHIP_PIC32CX1025SG41080_PINCTRL_H_ */
